<?php include 'inc/header.php'; ?>
<section id="rules">
    <h1>Как да играем</h1>
    <article class="clearfix">
        <h2>Мина</h2> 
        <section>
            <div class="left">
                <img src="images/mine-big.png" width="150" height="150" alt="mine" />
            </div>
            <div class="right">
                <p>Безценен ресурс, опазването на мините се извършва от пилетата. Способност за самозащита - никаква.</p>
                <p>Цена: 6</p>
            </div
        </section>
    </article>
    <article class="clearfix">
        <h2>Оборудвано Пиле</h2>
        <section>
            <div class="left">
                <img src="images/chicken-big.png" width="150" height="150" alt="chicken" />
            </div>
            <div class="right">
                <p>Оборудвано Пиле - Войн - защитник не работи на принципа "И сам война е войн", т.е. 
                    едно пиле става само за грила, за да убият едно гуци са нужни поне три, две го разсейват, 
                    а третото го издебва изотзад. За две гуцита подобно са нужни 5 пилета. 
                    За 3 гуцита са нужни 7 и т.н. </p>
                <p>Цена: 1</p>
            </div>
        </section>
    </article>
    <article class="clearfix">
        <h2>Гуци с Гърмелка</h2>
        <section>
            <div class="left">
                <img src="images/pig-big.png" width="150" height="150" alt="pig" />
            </div>
            <div class="right">
                <p>Войн - нападател, следвал военно дело в Япония, вследствие е способен само на камикадзе атаки, 
                    независимо дали успее в мисията си или не.</p>
                <p>Цена: 7</p>
            </div>
        </section>
    </article>
    <article class="clearfix">
        <h2>Голяма бомба</h2>
        <section>
            <div class="left">
                <img src="images/bomb-big.png" width="150" height="150" alt="bomb" />
            </div>
            <div class="right">
                <p>Голяма бомба - Най-мощното оръжие, помитащо всичко, което попадне в радиуса му на действие. 
                    Разработвана с помощта на руски учени в извънработно време, вследствие на което бомбата работи с 
                    водка или ракия. Радиуса на бомбата зависи от количеството водка/ракия налято в нея, като стандартна 
                    бомба с радиус 0 има Цена:10, а всяко увеличаване на радиуса с 1 струва още 10 пари. 
                    Така максимално голямата бомба, която може да се използва е с радиус 19 и би струвала 200.</p>
                <p>Цена: 10+</p>
            </div>
        </section>
    </article>
    <article class="clearfix">
        <h2>Пояснение</h2>
        <section>
            <div>
                <p>Пилетата са с обсег на защита с радиус 2 спрямо мястото където се намират.
                    Защитата на определена клетка се получава, като се събере броя на всички пилета в радиус 2 спрямо клетката.
                    Гуцитата имат обсег на действие на нападението им 1.5 т.е. ако има пилета на разстояние 2 от 
                    гуцитата, то тези пилета няма да бъдат засегнати от атаката, но тъй като гуцитата са в обсега на 
                    действие на пилетата, то в сумата на защитата ще се добави и бройката на пилетата. Ако броя пилета е  
                    поне с 1 повече от удвоения брой гуцита (пример 12 пилета и 5 гуцита), атаката е неуспешна и гуцитата 
                    се самоунищожават без да нанесат вреди,  обратно ако това съотношение не е изпълнено (пример 12 пилета 
                    и 6 гуцита)  гуцитата унищожават всички пилета и мини които се намират в обсега им.</p>
            </div>
        </section>
    </article>
</section>
<?php include 'inc/footer.php'; ?>